In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('income_test.csv',names=['name','income'],skiprows=[0])
df

        name    income
0      smith      5000
1     kelvin      6000
2        mak      4000
3     robber      7500
4  marqueees      8000
5    showrav      7000
6  elon musk  10000000

## using percentile to remove the outlier

In [5]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [6]:
df.income.quantile(0.75)

7750.0

In [8]:
df.income.quantile(0.50)

7000.0

In [9]:
df.income.quantile(0.25)

5500.0

In [10]:
df.income.quantile(0)

4000.0

### removing the outlier

In [12]:
percentile_99 = df.income.quantile(0.99)
percentile_99

9400479.999999994

## showing data points that are greater than 99 percentile

In [13]:
df[df.income>percentile_99]

        name    income
6  elon musk  10000000

In [14]:
df_not_outlier = df[df.income<percentile_99]
df_not_outlier

        name  income
0      smith    5000
1     kelvin    6000
2        mak    4000
3     robber    7500
4  marqueees    8000
5    showrav    7000

## Filling Missing Values
### editing the dataframe and making one income cell NaN

In [15]:
df['income'][3] = np.NaN #np is numpy library

/var/folders/jz/0lm3kv9d405_z6yy2lqf77d40000gn/T/ipykernel_87264/3683889496.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3] = np.NaN #np is numpy library

In [17]:
df # see robber income is blank

        name      income
0      smith      5000.0
1     kelvin      6000.0
2        mak      4000.0
3     robber         NaN
4  marqueees      8000.0
5    showrav      7000.0
6  elon musk  10000000.0

## now to fill in the data you have to work on your guess.
### by what value you want to fill in the data ? is it mean,mode or median?

In [18]:
df.income.mean() # average value

1671666.6666666667

In [19]:
df.income.median() # mid value of all data

6500.0

### if we want to fill the Nan value with median

In [21]:
df_new = df.fillna(df.income.median()) #replace all nan value of income column with median

In [22]:
df_new

        name      income
0      smith      5000.0
1     kelvin      6000.0
2        mak      4000.0
3     robber      6500.0
4  marqueees      8000.0
5    showrav      7000.0
6  elon musk  10000000.0